In [1]:
# import necessary packages
import pandas as pd

In [2]:
all_data=pd.read_csv('data/all_data.csv') # read data from cvs file
all_data.sample(10) # show 10 random samples

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
136073,208930,Apple Airpods Headphones,1,150,05/02/19 09:38,"147 Adams St, Boston, MA 02215"
136140,208996,AA Batteries (4-pack),1,3.84,05/04/19 09:56,"745 2nd St, New York City, NY 10001"
34481,299553,Flatscreen TV,1,300,12/17/19 18:56,"136 2nd St, Los Angeles, CA 90001"
103872,221592,USB-C Charging Cable,1,11.95,06/23/19 12:56,"121 Church St, San Francisco, CA 94016"
186300,258837,AA Batteries (4-pack),1,3.84,09/18/19 09:22,"661 Forest St, Austin, TX 73301"
113282,169666,Bose SoundSport Headphones,1,99.99,03/28/19 08:05,"513 4th St, Atlanta, GA 30301"
115146,171452,27in FHD Monitor,1,149.99,03/21/19 19:10,"774 Elm St, Boston, MA 02215"
114499,170827,Lightning Charging Cable,1,14.95,03/08/19 12:17,"939 7th St, Los Angeles, CA 90001"
1035,177542,AAA Batteries (4-pack),1,2.99,04/09/19 13:44,"239 River St, Portland, ME 04101"
64097,158695,Apple Airpods Headphones,1,150,02/18/19 17:05,"535 Hickory St, Dallas, TX 75001"

In [3]:
# get familiar with features using describe and info
all_data.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,186305,186305,186305,186305,186305,186305
unique,178438,20,10,24,142396,140788
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,355,21903,168552,21903,355,355

In [4]:
all_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
Order ID            186305 non-null object
Product             186305 non-null object
Quantity Ordered    186305 non-null object
Price Each          186305 non-null object
Order Date          186305 non-null object
Purchase Address    186305 non-null object
dtypes: object(6)
memory usage: 8.6+ MB

## First Stage : Clean up the data!

### 1. check for nans

In [5]:
all_data.isna().sum()

Order ID            545
Product             545
Quantity Ordered    545
Price Each          545
Order Date          545
Purchase Address    545
dtype: int64

In [6]:
# we will remove nans , their count is small relative to dataset size
all_data.dropna(inplace=True)
# check again
all_data.isna().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [7]:
all_data[all_data['Order Date']=='Order Date'] # there is issue in data , we need to fix this

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
519,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1149,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1155,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2878,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
2893,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
...,...,...,...,...,...,...
185164,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
185551,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
186563,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
186632,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
186738,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address

In [8]:
all_data = all_data[all_data['Order Date'].str[0]!='O'] # remove any row which starts with O from order date column
all_data

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"
...,...,...,...,...,...,...
186845,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
186846,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
186847,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
186848,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
186849,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

In [9]:
# we need to convert quantity and price into numeric data types
all_data['Quantity Ordered'] = pd.to_numeric(all_data['Quantity Ordered'])
all_data['Price Each'] = pd.to_numeric(all_data['Price Each'])
# check 
all_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 6 columns):
Order ID            185950 non-null object
Product             185950 non-null object
Quantity Ordered    185950 non-null int64
Price Each          185950 non-null float64
Order Date          185950 non-null object
Purchase Address    185950 non-null object
dtypes: float64(1), int64(1), object(4)
memory usage: 9.9+ MB

### 2 . rearrange order date feature

`for better analysis , we need to split order date feature into two features , date(day/month/year) and time`

In [10]:
all_data['Order Date dmy']=pd.to_datetime(all_data['Order Date'].apply(lambda x:str(x).split(' ')[0]))
all_data['Order Date time']=pd.to_datetime(all_data['Order Date'].apply(lambda x:str(x).split(' ')[1])).dt.time

In [11]:
# check rearrangment is done
all_data['Order Date dmy']

0        2019-04-19
2        2019-04-07
3        2019-04-12
4        2019-04-12
5        2019-04-30
            ...
186845   2019-09-17
186846   2019-09-01
186847   2019-09-23
186848   2019-09-19
186849   2019-09-30
Name: Order Date dmy, Length: 185950, dtype: datetime64[ns]

In [12]:
all_data['Order Date time']

0         08:46:00
2         22:30:00
3         14:38:00
4         14:38:00
5         09:27:00
            ...
186845    20:56:00
186846    16:00:00
186847    07:39:00
186848    17:30:00
186849    00:18:00
Name: Order Date time, Length: 185950, dtype: object

In [13]:
# also for analysis purpose we may need to add new column month only column
all_data['Order Date month'] = pd.to_datetime(all_data['Order Date']).dt.month

In [14]:
all_data['Order Date month'].sample(10)

6372       4
19454      8
118776     3
93890      6
62870      2
143922    11
66152      2
144296    11
43672     12
25999      8
Name: Order Date month, dtype: int64

### 3. add state column

In [23]:
# we note that for example address : 669 Spruce St, Los Angeles, CA 90001 , but we only insterested in state (Los Angeles)
def extract_city(address):
    '''
    function to extract state from purchase address
    '''
    # convert row to string
    str_address=str(address)
    return str_address.split(',')[1].strip()

all_data['state']=all_data['Purchase Address'].apply(lambda x :extract_city(x))

In [28]:
# check for state column
all_data['state'].sample(10)

108368      Los Angeles
124676      Los Angeles
173235      Los Angeles
104793          Seattle
182846           Austin
165521           Boston
146887    New York City
93910            Dallas
30197     New York City
10646     San Francisco
Name: state, dtype: object

## Stage 2 : Data Analysis & Exploration

In [72]:
from IPython.display import display
df=pd.DataFrame(all_data.groupby(['reduced_categories','state'])['Quantity Ordered'].sum())
display(df)

                                  Quantity Ordered
reduced_categories state
Batteries          Atlanta                    4552
                   Austin                     3092
                   Boston                     6477
                   Dallas                     4765
                   Los Angeles                9405
...                                            ...
Washing Machines   Los Angeles                 221
                   New York City               162
                   Portland                     74
                   San Francisco               323
                   Seattle                     114

[63 rows x 1 columns]

In [74]:
df.index[0]S

('Batteries', 'Atlanta')

In [36]:
all_data.sample(5)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Order Date dmy,Order Date time,Order Date month,state
66924,161415,Lightning Charging Cable,1,14.95,02/13/19 10:50,"812 Lakeview St, Dallas, TX 75001",2019-02-13,10:50:00,2,Dallas
64921,159486,Wired Headphones,1,11.99,02/06/19 06:15,"400 5th St, Austin, TX 73301",2019-02-06,06:15:00,2,Austin
23848,241915,Google Phone,1,600.00,08/26/19 20:39,"797 Chestnut St, Los Angeles, CA 90001",2019-08-26,20:39:00,8,Los Angeles
1993,178455,Apple Airpods Headphones,1,150.00,04/25/19 10:59,"598 Chestnut St, Los Angeles, CA 90001",2019-04-25,10:59:00,4,Los Angeles
38055,302974,27in 4K Gaming Monitor,1,389.99,12/17/19 13:55,"967 Lake St, Boston, MA 02215",2019-12-17,13:55:00,12,Boston

In [49]:
all_data['Product'].value_counts()

USB-C Charging Cable          21903
Lightning Charging Cable      21658
AAA Batteries (4-pack)        20641
AA Batteries (4-pack)         20577
Wired Headphones              18882
Apple Airpods Headphones      15549
Bose SoundSport Headphones    13325
27in FHD Monitor               7507
iPhone                         6842
27in 4K Gaming Monitor         6230
34in Ultrawide Monitor         6181
Google Phone                   5525
Flatscreen TV                  4800
Macbook Pro Laptop             4724
ThinkPad Laptop                4128
20in Monitor                   4101
Vareebadd Phone                2065
LG Washing Machine              666
LG Dryer                        646
Name: Product, dtype: int64

In [67]:
def reduce_category(product):
    product=str(product)
    if 'Cable' in product:
        return 'Cables'
    elif 'Batteries' in product:
        return 'Batteries'
    elif 'Monitor' in product or 'TV' in product:
        return 'Monitors'
    elif 'Headphones' in product:
        return 'Headphones'
    elif 'Laptop' in product:
        return 'Laptop'
    elif 'Phone' in product:
        return 'Mobile Phone'
    else:
        return 'Washing Machines'

all_data['reduced_categories']=all_data['Product'].apply(lambda x :reduce_category(x))

In [69]:
all_data['reduced_categories'].value_counts()

Headphones          47756
Cables              43561
Batteries           41218
Monitors            28819
Mobile Phone        14432
Laptop               8852
Washing Machines     1312
Name: reduced_categories, dtype: int64